from django.db import migrations

def add_provinces_and_cities(apps, schema_editor):
    Province = apps.get_model('main', 'Province')
    City = apps.get_model('main', 'City')

    provinces_and_cities = {
        "آذربایجان شرقی": ["تبریز", "مراغه", "مرند", "میانه", "اهر", "بناب", "شبستر", "سراب", "هشترود", "جلفا"],
        "آذربایجان غربی": ["ارومیه", "خوی", "میاندوآب", "بوکان", "سلماس", "مهاباد", "پیرانشهر", "نقده"],
        "اردبیل": ["اردبیل", "مشگین‌شهر", "پارس‌آباد", "خلخال", "نمین", "بیله‌سوار"],
        "اصفهان": ["اصفهان", "کاشان", "نجف‌آباد", "خمینی‌شهر", "شاهین‌شهر", "زرین‌شهر", "فلاورجان"],
        "البرز": ["کرج", "فردیس", "محمدشهر", "نظرآباد", "هشتگرد"],
        "ایلام": ["ایلام", "دهلران", "آبدانان", "ایوان"],
        "بوشهر": ["بوشهر", "برازجان", "گناوه", "کنگان", "جم"],
        "تهران": ["تهران", "ری", "اسلامشهر", "قدس", "ورامین", "شهریار", "پردیس", "دماوند", "رباط‌کریم"],
        "چهارمحال و بختیاری": ["شهرکرد", "فارسان", "بروجن", "لردگان"],
        "خراسان جنوبی": ["بیرجند", "قائن", "طبس", "نهبندان"],
        "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار", "تربت‌جام", "قوچان", "تربت‌حیدریه", "کاشمر"],
        "خراسان شمالی": ["بجنورد", "اسفراین", "شیروان", "مانه‌وسملقان"],
        "خوزستان": ["اهواز", "دزفول", "آبادان", "خرمشهر", "ماهشهر", "شادگان", "اندیمشک", "بهبهان"],
        "زنجان": ["زنجان", "ابهر", "خدابنده", "طارم"],
        "سمنان": ["سمنان", "شاهرود", "دامغان", "گرمسار"],
        "سیستان و بلوچستان": ["زاهدان", "چابهار", "ایرانشهر", "خاش", "سراوان"],
        "فارس": ["شیراز", "مرودشت", "کازرون", "لار", "فسا", "جهرم", "داراب"],
        "قزوین": ["قزوین", "الوند", "آبیک", "بوئین‌زهرا"],
        "قم": ["قم"],
        "کردستان": ["سنندج", "سقز", "بانه", "مریوان", "قروه"],
        "کرمان": ["کرمان", "رفسنجان", "جیرفت", "زرند", "بم"],
        "کرمانشاه": ["کرمانشاه", "اسلام‌آباد غرب", "سنقر", "هرسین"],
        "کهگیلویه و بویراحمد": ["یاسوج", "دهدشت", "گچساران"],
        "گلستان": ["گرگان", "گنبد", "علی‌آباد", "آزادشهر"],
        "گیلان": ["رشت", "انزلی", "لاهیجان", "لنگرود", "آستانه", "تالش", "رودسر"],
        "لرستان": ["خرم‌آباد", "بروجرد", "دورود", "الیگودرز", "کوهدشت"],
        "مازندران": ["ساری", "بابل", "آمل", "قائم‌شهر", "بهشهر", "چالوس", "نوشهر"],
        "مرکزی": ["اراک", "ساوه", "خمین", "دلیجان"],
        "هرمزگان": ["بندرعباس", "قشم", "میناب", "بندر لنگه", "حاجی‌آباد"],
        "همدان": ["همدان", "ملایر", "نهاوند", "کبودرآهنگ"],
        "یزد": ["یزد", "میبد", "اردکان", "بافق"]
    }

    for province_name, cities in provinces_and_cities.items():
        province_obj, created = Province.objects.get_or_create(name=province_name)
        for city_name in cities:
            City.objects.get_or_create(name=city_name, province=province_obj)

class Migration(migrations.Migration):

    dependencies = [
        ('main', '0002_add_initial_books'),  # آخرین مایگریشن کتاب‌ها
    ]

    operations = [
        migrations.RunPython(add_provinces_and_cities),
    ]